# Core CLI
brew "git"
brew "gh"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "fzf"
brew "zoxide"
brew "direnv"
brew "starship"
brew "httpie"
brew "lazygit"
brew "git-delta"
brew "stow"

# Runtime manager
brew "mise"

# Containers (open-source)
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"

# Infra
brew "azure-cli"
brew "helm"
brew "kubectl"
brew "k9s"

# Node ecosystem
brew "corepack"

# Python tooling
brew "pipx"

# Local HTTPS certs
brew "mkcert"
brew "nss"

# Dock management
brew "dockutil"

# GUI apps
cask "visual-studio-code"
cask "claude"
cask "firefox"
cask "iterm2"
cask "rectangle"
cask "tailscale-app"
cask "microsoft-remote-desktop"
